/* 

1. С использованием значений массива создать маркированный список.
 Создать кнопки 'добавить' и 'удалить', которые будут 
 менять состав списка.
 Для оптимизации списка нужно добавить кастомный атрибут id. 
 В списке четное значение должно красится красным 
 а не четные в синим цветом.

*/

/*

2. В форме авторизации пользователь должен ввести 
логин и пароль для входа в систему.
  - кнопка 'Войти' становится активной только в том 
    случае когда заполнены оба поля и пользователь отметил чекбокс
  - поле логин должно содержать значение минимум 4 символа
  - поле пароль от 8-30 символов
  - если условия не соответствуют требованиям то 
    при потере фокуса поле ввода показывает ошибку
  - после нажатия кнопки Войти надо вывести сообщение 
    об успешной авторизацие

*/

/* 

3. Создать небольшую игру :)
  - Изначально на экране пользователя будет отображаться какая 
    нибудь форма (круг, квадрат, прямоугольник)
  - при нажатии на нее в рандомном порядке форма должна менятся на другую
  - форма каждый раз должна появляться в разных местах на странице
  - цвет формы в рандомном порядке меняется, 
    используя цвета из заранее заготовленного массива
  

*/
