const EVENT_PHASES = {
  NONE: 0,
  CAPTURE: 1,
  TARGET: 2,
  BUBBLE: 3
};

/*

  1. Протестировать основные принципы распространения 
  (event propagation) и всплытия (event bubbling) событий

  см. в index.html

*/

/* 

  2. Используя делегирование событий обработать нажатие любой кнопки внутри #container
  окрасив квадрат #square в соответствующий цвет. Кнопка после нажатия должна стать активной,
  после второго нажатия активный стиль нужно удалить и вернуть квадрат в исходный вид

  см. в index.html

*/

/* 

  3. Посмотреть на примере как работают throttle и debounce (использовать lodash)
     В каких случиях их использовать.

*/

/* 

  4. Используя IntersectionObserver посмотреть на примере принцип работы данного функционала.
     Так же использовать pollyfil

*/

/* 

  5. Написать LazyLoad картинок с помощью IntersectionObserver

*/
